export default {
  input: {},

  button: {},

  validation: {
    min: 'Мінімальна кіл-сть символів: {{value}}',
    max: 'Максимальна кіл-сть символів: {{value}}',
    email: 'Недійсна електронна адреса',
    phone: 'Недійсний номер телефону',
    required: "Це поле обов'язкове",
    password: 'Недійсний пароль',
    number: 'Поле має містити числове значення',
    length: 'Поле має мати довжину {{value}}',
  },

  error: {
    NETWORK_ERROR:
      "Помилка мережевого з'єднання. Будь ласка, перевірте інтернет та спробуйте ще раз.",
    TIMEOUT_ERROR: 'Час очікування вичерпано. Будь ласка, спробуйте пізніше.',
    SERVER_ERROR:
      'Сталася помилка сервера. Наша команда вже сповіщена. Будь ласка, спробуйте пізніше.',
    NOT_FOUND: 'Запитуваний ресурс не знайдено.',
    UNAUTHORIZED: 'Будь ласка, увійдіть для продовження.',
    FORBIDDEN: 'У вас немає дозволу на доступ до цього ресурсу.',
    BAD_REQUEST: 'Невірний запит. Будь ласка, перевірте введені дані.',
    DEFAULT_ERROR: 'Щось пішло не так. Будь ласка, спробуйте ще раз.',
  },

  common: {},

  toast: {
    success: {},
  },
}
